---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SpatialFieldMgrCurrentName
source: html/ffa59457-f0d6-8cdb-012d-ffede3e140c2.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SpatialFieldMgrCurrentName Property

"Analysis Configuration"

## Syntax (C#)
```csharp
public static ForgeTypeId SpatialFieldMgrCurrentName { get; }
```